# A guide to fine-tuning Code Llama

**In this guide I show you how to fine-tune Code Llama to become a beast of an SQL developer. For coding tasks, you can generally get much better performance out of Code Llama than Llama 2, especially when you specialise the model on a particular task:**

- I use the [b-mc2/sql-create-context](https://huggingface.co/datasets/b-mc2/sql-create-context) which is a bunch of text queries and their corresponding SQL queries
- A Lora approach, quantizing the base model to int 8, freezing its weights and only training an adapter
- Much of the code is borrowed from [alpaca-lora](https://github.com/tloen/alpaca-lora), but I refactored it quite a bit for this

### 2. Pip installs

In [1]:
!pip install git+https://github.com/huggingface/transformers.git@main bitsandbytes accelerate==0.20.3  # we need latest transformers for this
!pip install git+https://github.com/huggingface/peft.git@e536616888d51b453ed354a6f1e243fecb02ea08
!pip install datasets==2.10.1
import locale # colab workaround
locale.getpreferredencoding = lambda: "UTF-8" # colab workaround
!pip install wandb
!pip install scipy

Collecting git+https://github.com/huggingface/transformers.git@main
  Cloning https://github.com/huggingface/transformers.git (to revision main) to /var/tmp/pip-req-build-l3o2ep8r
  Running command git clone --filter=blob:none --quiet https://github.com/huggingface/transformers.git /var/tmp/pip-req-build-l3o2ep8r
  Resolved https://github.com/huggingface/transformers.git to commit 0b192de1f353b0e04dad4813e02e2c672de077be
  Installing build dependencies ... done
  Getting requirements to build wheel ... done
  Preparing metadata (pyproject.toml) ... done
Requirement already satisfied: bitsandbytes in /opt/conda/lib/python3.10/site-packages (0.41.1)
Requirement already satisfied: accelerate==0.20.3 in /opt/conda/lib/python3.10/site-packages (0.20.3)
Requirement already satisfied: numpy>=1.17 in /opt/conda/lib/python3.10/site-packages (from accelerate==0.20.3) (1.23.5)
Requirement already satisfied: packaging>=20.0 in /opt/conda/lib/python3.10/site-packages (from accelerate==0.20.3) (23.1)
Requirement already satisfied: psutil in /opt/conda/lib/python3.10/site-packages (from accelerate==0.20.3) (5.9.3)
Requirement already satisfied: pyyaml in /opt/conda/lib/python3.10/site-packages (from accelerate==0.20.3) (6.0.1)
Requirement already satisfied: torch>=1.6.0 in /opt/conda/lib/python3.10/site-packages (from accelerate==0.20.3) (2.0.1)
Requirement already satisfied: filelock in /opt/conda/lib/python3.10/site-packages (from transformers==4.34.0.dev0) (3.12.2)
Requirement already satisfied: huggingface-hub<1.0,>=0.16.4 in /opt/conda/lib/python3.10/site-packages (from transformers==4.34.0.dev0) (0.16.4)
Requirement already satisfied: regex!=2019.12.17 in /opt/conda/lib/python3.10/site-packages (from transformers==4.34.0.dev0) (2023.8.8)
Requirement already satisfied: requests in /opt/conda/lib/python3.10/site-packages (from transformers==4.34.0.dev0) (2.31.0)
Requirement already satisfied: tokenizers<0.15,>=0.14 in /opt/conda/lib/python3.10/site-packages (from transformers==4.34.0.dev0) (0.14.0)
Requirement already satisfied: safetensors>=0.3.1 in /opt/conda/lib/python3.10/site-packages (from transformers==4.34.0.dev0) (0.3.3)
Requirement already satisfied: tqdm>=4.27 in /opt/conda/lib/python3.10/site-packages (from transformers==4.34.0.dev0) (4.66.1)
Requirement already satisfied: fsspec in /opt/conda/lib/python3.10/site-packages (from huggingface-hub<1.0,>=0.16.4->transformers==4.34.0.dev0) (2023.6.0)
Requirement already satisfied: typing-extensions>=3.7.4.3 in /opt/conda/lib/python3.10/site-packages (from huggingface-hub<1.0,>=0.16.4->transformers==4.34.0.dev0) (4.7.1)
Requirement already satisfied: sympy in /opt/conda/lib/python3.10/site-packages (from torch>=1.6.0->accelerate==0.20.3) (1.12)
Requirement already satisfied: networkx in /opt/conda/lib/python3.10/site-packages (from torch>=1.6.0->accelerate==0.20.3) (3.1)
Requirement already satisfied: jinja2 in /opt/conda/lib/python3.10/site-packages (from torch>=1.6.0->accelerate==0.20.3) (3.1.2)
Requirement already satisfied: nvidia-cuda-nvrtc-cu11==11.7.99 in /opt/conda/lib/python3.10/site-packages (from torch>=1.6.0->accelerate==0.20.3) (11.7.99)
Requirement already satisfied: nvidia-cuda-runtime-cu11==11.7.99 in /opt/conda/lib/python3.10/site-packages (from torch>=1.6.0->accelerate==0.20.3) (11.7.99)
Requirement already satisfied: nvidia-cuda-cupti-cu11==11.7.101 in /opt/conda/lib/python3.10/site-packages (from torch>=1.6.0->accelerate==0.20.3) (11.7.101)
Requirement already satisfied: nvidia-cudnn-cu11==8.5.0.96 in /opt/conda/lib/python3.10/site-packages (from torch>=1.6.0->accelerate==0.20.3) (8.5.0.96)
Requirement already satisfied: nvidia-cublas-cu11==11.10.3.66 in /opt/conda/lib/python3.10/site-packages (from torch>=1.6.0->accelerate==0.20.3) (11.10.3.66)
Requirement already satisfied: nvidia-cufft-cu11==10.9.0.58 in /opt/conda/lib/python3.10/site-packages (from torch>=1.6.0->accelerate==0.20.3) (10.9.0.58)
Requirement already satisfied: nvidia-curand-cu11==10.2.10.91 in /opt/conda/lib/python3.10/site-packages (from torch>=1.6.0->accelerate==0.20.3) (10.2.10.91)
Requirement already satisfied: nvidia-cusolver-cu11==11.4.0.1 in /opt/conda/lib/python3.10/site-packages (from torch>=1.6.0->accelerate==0.20.3) (11.4.0.1)
Requirement already satisfied: nvidia-cusparse-cu11==11.7.4.91 in /opt/conda/lib/python3.10/site-packages (from torch>=1.6.0->accelerate==0.20.3) (11.7.4.91)
Requirement already satisfied: nvidia-nccl-cu11==2.14.3 in /opt/conda/lib/python3.10/site-packages (from torch>=1.6.0->accelerate==0.20.3) (2.14.3)
Requirement already satisfied: nvidia-nvtx-cu11==11.7.91 in /opt/conda/lib/python3.10/site-packages (from torch>=1.6.0->accelerate==0.20.3) (11.7.91)
Requirement already satisfied: triton==2.0.0 in /opt/conda/lib/python3.10/site-packages (from torch>=1.6.0->accelerate==0.20.3) (2.0.0)
Requirement already satisfied: setuptools in /opt/conda/lib/python3.10/site-packages (from nvidia-cublas-cu11==11.10.3.66->torch>=1.6.0->accelerate==0.20.3) (68.1.2)
Requirement already satisfied: wheel in /opt/conda/lib/python3.10/site-packages (from nvidia-cublas-cu11==11.10.3.66->torch>=1.6.0->accelerate==0.20.3) (0.41.2)
Requirement already satisfied: cmake in /opt/conda/lib/python3.10/site-packages (from triton==2.0.0->torch>=1.6.0->accelerate==0.20.3) (3.27.5)
Requirement already satisfied: lit in /opt/conda/lib/python3.10/site-packages (from triton==2.0.0->torch>=1.6.0->accelerate==0.20.3) (16.0.6)
Requirement already satisfied: charset-normalizer<4,>=2 in /opt/conda/lib/python3.10/site-packages (from requests->transformers==4.34.0.dev0) (3.2.0)
Requirement already satisfied: idna<4,>=2.5 in /opt/conda/lib/python3.10/site-packages (from requests->transformers==4.34.0.dev0) (3.4)
Requirement already satisfied: urllib3<3,>=1.21.1 in /opt/conda/lib/python3.10/site-packages (from requests->transformers==4.34.0.dev0) (1.26.16)
Requirement already satisfied: certifi>=2017.4.17 in /opt/conda/lib/python3.10/site-packages (from requests->transformers==4.34.0.dev0) (2023.7.22)
Requirement already satisfied: MarkupSafe>=2.0 in /opt/conda/lib/python3.10/site-packages (from jinja2->torch>=1.6.0->accelerate==0.20.3) (2.1.3)
Requirement already satisfied: mpmath>=0.19 in /opt/conda/lib/python3.10/site-packages (from sympy->torch>=1.6.0->accelerate==0.20.3) (1.3.0)
Collecting git+https://github.com/huggingface/peft.git@e536616888d51b453ed354a6f1e243fecb02ea08
  Cloning https://github.com/huggingface/peft.git (to revision e536616888d51b453ed354a6f1e243fecb02ea08) to /var/tmp/pip-req-build-b_3p_5jc
  Running command git clone --filter=blob:none --quiet https://github.com/huggingface/peft.git /var/tmp/pip-req-build-b_3p_5jc
  Running command git rev-parse -q --verify 'sha^e536616888d51b453ed354a6f1e243fecb02ea08'
  Running command git fetch -q https://github.com/huggingface/peft.git e536616888d51b453ed354a6f1e243fecb02ea08
  Running command git checkout -q e536616888d51b453ed354a6f1e243fecb02ea08
  Resolved https://github.com/huggingface/peft.git to commit e536616888d51b453ed354a6f1e243fecb02ea08
  Installing build dependencies ... done
  Getting requirements to build wheel ... done
  Preparing metadata (pyproject.toml) ... done
Requirement already satisfied: numpy>=1.17 in /opt/conda/lib/python3.10/site-packages (from peft==0.3.0.dev0) (1.23.5)
Requirement already satisfied: packaging>=20.0 in /opt/conda/lib/python3.10/site-packages (from peft==0.3.0.dev0) (23.1)
Requirement already satisfied: psutil in /opt/conda/lib/python3.10/site-packages (from peft==0.3.0.dev0) (5.9.3)
Requirement already satisfied: pyyaml in /opt/conda/lib/python3.10/site-packages (from peft==0.3.0.dev0) (6.0.1)
Requirement already satisfied: torch>=1.13.0 in /opt/conda/lib/python3.10/site-packages (from peft==0.3.0.dev0) (2.0.1)
Requirement already satisfied: transformers in /opt/conda/lib/python3.10/site-packages (from peft==0.3.0.dev0) (4.34.0.dev0)
Requirement already satisfied: accelerate in /opt/conda/lib/python3.10/site-packages (from peft==0.3.0.dev0) (0.20.3)
Requirement already satisfied: filelock in /opt/conda/lib/python3.10/site-packages (from torch>=1.13.0->peft==0.3.0.dev0) (3.12.2)
Requirement already satisfied: typing-extensions in /opt/conda/lib/python3.10/site-packages (from torch>=1.13.0->peft==0.3.0.dev0) (4.7.1)
Requirement already satisfied: sympy in /opt/conda/lib/python3.10/site-packages (from torch>=1.13.0->peft==0.3.0.dev0) (1.12)
Requirement already satisfied: networkx in /opt/conda/lib/python3.10/site-packages (from torch>=1.13.0->peft==0.3.0.dev0) (3.1)
Requirement already satisfied: jinja2 in /opt/conda/lib/python3.10/site-packages (from torch>=1.13.0->peft==0.3.0.dev0) (3.1.2)
Requirement already satisfied: nvidia-cuda-nvrtc-cu11==11.7.99 in /opt/conda/lib/python3.10/site-packages (from torch>=1.13.0->peft==0.3.0.dev0) (11.7.99)
Requirement already satisfied: nvidia-cuda-runtime-cu11==11.7.99 in /opt/conda/lib/python3.10/site-packages (from torch>=1.13.0->peft==0.3.0.dev0) (11.7.99)
Requirement already satisfied: nvidia-cuda-cupti-cu11==11.7.101 in /opt/conda/lib/python3.10/site-packages (from torch>=1.13.0->peft==0.3.0.dev0) (11.7.101)
Requirement already satisfied: nvidia-cudnn-cu11==8.5.0.96 in /opt/conda/lib/python3.10/site-packages (from torch>=1.13.0->peft==0.3.0.dev0) (8.5.0.96)
Requirement already satisfied: nvidia-cublas-cu11==11.10.3.66 in /opt/conda/lib/python3.10/site-packages (from torch>=1.13.0->peft==0.3.0.dev0) (11.10.3.66)
Requirement already satisfied: nvidia-cufft-cu11==10.9.0.58 in /opt/conda/lib/python3.10/site-packages (from torch>=1.13.0->peft==0.3.0.dev0) (10.9.0.58)
Requirement already satisfied: nvidia-curand-cu11==10.2.10.91 in /opt/conda/lib/python3.10/site-packages (from torch>=1.13.0->peft==0.3.0.dev0) (10.2.10.91)
Requirement already satisfied: nvidia-cusolver-cu11==11.4.0.1 in /opt/conda/lib/python3.10/site-packages (from torch>=1.13.0->peft==0.3.0.dev0) (11.4.0.1)
Requirement already satisfied: nvidia-cusparse-cu11==11.7.4.91 in /opt/conda/lib/python3.10/site-packages (from torch>=1.13.0->peft==0.3.0.dev0) (11.7.4.91)
Requirement already satisfied: nvidia-nccl-cu11==2.14.3 in /opt/conda/lib/python3.10/site-packages (from torch>=1.13.0->peft==0.3.0.dev0) (2.14.3)
Requirement already satisfied: nvidia-nvtx-cu11==11.7.91 in /opt/conda/lib/python3.10/site-packages (from torch>=1.13.0->peft==0.3.0.dev0) (11.7.91)
Requirement already satisfied: triton==2.0.0 in /opt/conda/lib/python3.10/site-packages (from torch>=1.13.0->peft==0.3.0.dev0) (2.0.0)
Requirement already satisfied: setuptools in /opt/conda/lib/python3.10/site-packages (from nvidia-cublas-cu11==11.10.3.66->torch>=1.13.0->peft==0.3.0.dev0) (68.1.2)
Requirement already satisfied: wheel in /opt/conda/lib/python3.10/site-packages (from nvidia-cublas-cu11==11.10.3.66->torch>=1.13.0->peft==0.3.0.dev0) (0.41.2)
Requirement already satisfied: cmake in /opt/conda/lib/python3.10/site-packages (from triton==2.0.0->torch>=1.13.0->peft==0.3.0.dev0) (3.27.5)
Requirement already satisfied: lit in /opt/conda/lib/python3.10/site-packages (from triton==2.0.0->torch>=1.13.0->peft==0.3.0.dev0) (16.0.6)
Requirement already satisfied: huggingface-hub<1.0,>=0.16.4 in /opt/conda/lib/python3.10/site-packages (from transformers->peft==0.3.0.dev0) (0.16.4)
Requirement already satisfied: regex!=2019.12.17 in /opt/conda/lib/python3.10/site-packages (from transformers->peft==0.3.0.dev0) (2023.8.8)
Requirement already satisfied: requests in /opt/conda/lib/python3.10/site-packages (from transformers->peft==0.3.0.dev0) (2.31.0)
Requirement already satisfied: tokenizers<0.15,>=0.14 in /opt/conda/lib/python3.10/site-packages (from transformers->peft==0.3.0.dev0) (0.14.0)
Requirement already satisfied: safetensors>=0.3.1 in /opt/conda/lib/python3.10/site-packages (from transformers->peft==0.3.0.dev0) (0.3.3)
Requirement already satisfied: tqdm>=4.27 in /opt/conda/lib/python3.10/site-packages (from transformers->peft==0.3.0.dev0) (4.66.1)
Requirement already satisfied: fsspec in /opt/conda/lib/python3.10/site-packages (from huggingface-hub<1.0,>=0.16.4->transformers->peft==0.3.0.dev0) (2023.6.0)
Requirement already satisfied: MarkupSafe>=2.0 in /opt/conda/lib/python3.10/site-packages (from jinja2->torch>=1.13.0->peft==0.3.0.dev0) (2.1.3)
Requirement already satisfied: charset-normalizer<4,>=2 in /opt/conda/lib/python3.10/site-packages (from requests->transformers->peft==0.3.0.dev0) (3.2.0)
Requirement already satisfied: idna<4,>=2.5 in /opt/conda/lib/python3.10/site-packages (from requests->transformers->peft==0.3.0.dev0) (3.4)
Requirement already satisfied: urllib3<3,>=1.21.1 in /opt/conda/lib/python3.10/site-packages (from requests->transformers->peft==0.3.0.dev0) (1.26.16)
Requirement already satisfied: certifi>=2017.4.17 in /opt/conda/lib/python3.10/site-packages (from requests->transformers->peft==0.3.0.dev0) (2023.7.22)
Requirement already satisfied: mpmath>=0.19 in /opt/conda/lib/python3.10/site-packages (from sympy->torch>=1.13.0->peft==0.3.0.dev0) (1.3.0)
Requirement already satisfied: datasets==2.10.1 in /opt/conda/lib/python3.10/site-packages (2.10.1)
Requirement already satisfied: numpy>=1.17 in /opt/conda/lib/python3.10/site-packages (from datasets==2.10.1) (1.23.5)
Requirement already satisfied: pyarrow>=6.0.0 in /opt/conda/lib/python3.10/site-packages (from datasets==2.10.1) (12.0.1)
Requirement already satisfied: dill<0.3.7,>=0.3.0 in /opt/conda/lib/python3.10/site-packages (from datasets==2.10.1) (0.3.6)
Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (from datasets==2.10.1) (2.0.3)
Requirement already satisfied: requests>=2.19.0 in /opt/conda/lib/python3.10/site-packages (from datasets==2.10.1) (2.31.0)
Requirement already satisfied: tqdm>=4.62.1 in /opt/conda/lib/python3.10/site-packages (from datasets==2.10.1) (4.66.1)
Requirement already satisfied: xxhash in /opt/conda/lib/python3.10/site-packages (from datasets==2.10.1) (3.3.0)
Requirement already satisfied: multiprocess in /opt/conda/lib/python3.10/site-packages (from datasets==2.10.1) (0.70.14)
Requirement already satisfied: fsspec[http]>=2021.11.1 in /opt/conda/lib/python3.10/site-packages (from datasets==2.10.1) (2023.6.0)
Requirement already satisfied: aiohttp in /opt/conda/lib/python3.10/site-packages (from datasets==2.10.1) (3.8.5)
Requirement already satisfied: huggingface-hub<1.0.0,>=0.2.0 in /opt/conda/lib/python3.10/site-packages (from datasets==2.10.1) (0.16.4)
Requirement already satisfied: packaging in /opt/conda/lib/python3.10/site-packages (from datasets==2.10.1) (23.1)
Requirement already satisfied: responses<0.19 in /opt/conda/lib/python3.10/site-packages (from datasets==2.10.1) (0.18.0)
Requirement already satisfied: pyyaml>=5.1 in /opt/conda/lib/python3.10/site-packages (from datasets==2.10.1) (6.0.1)
Requirement already satisfied: attrs>=17.3.0 in /opt/conda/lib/python3.10/site-packages (from aiohttp->datasets==2.10.1) (23.1.0)
Requirement already satisfied: charset-normalizer<4.0,>=2.0 in /opt/conda/lib/python3.10/site-packages (from aiohttp->datasets==2.10.1) (3.2.0)
Requirement already satisfied: multidict<7.0,>=4.5 in /opt/conda/lib/python3.10/site-packages (from aiohttp->datasets==2.10.1) (6.0.4)
Requirement already satisfied: async-timeout<5.0,>=4.0.0a3 in /opt/conda/lib/python3.10/site-packages (from aiohttp->datasets==2.10.1) (4.0.3)
Requirement already satisfied: yarl<2.0,>=1.0 in /opt/conda/lib/python3.10/site-packages (from aiohttp->datasets==2.10.1) (1.9.2)
Requirement already satisfied: frozenlist>=1.1.1 in /opt/conda/lib/python3.10/site-packages (from aiohttp->datasets==2.10.1) (1.4.0)
Requirement already satisfied: aiosignal>=1.1.2 in /opt/conda/lib/python3.10/site-packages (from aiohttp->datasets==2.10.1) (1.3.1)
Requirement already satisfied: filelock in /opt/conda/lib/python3.10/site-packages (from huggingface-hub<1.0.0,>=0.2.0->datasets==2.10.1) (3.12.2)
Requirement already satisfied: typing-extensions>=3.7.4.3 in /opt/conda/lib/python3.10/site-packages (from huggingface-hub<1.0.0,>=0.2.0->datasets==2.10.1) (4.7.1)
Requirement already satisfied: idna<4,>=2.5 in /opt/conda/lib/python3.10/site-packages (from requests>=2.19.0->datasets==2.10.1) (3.4)
Requirement already satisfied: urllib3<3,>=1.21.1 in /opt/conda/lib/python3.10/site-packages (from requests>=2.19.0->datasets==2.10.1) (1.26.16)
Requirement already satisfied: certifi>=2017.4.17 in /opt/conda/lib/python3.10/site-packages (from requests>=2.19.0->datasets==2.10.1) (2023.7.22)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/conda/lib/python3.10/site-packages (from pandas->datasets==2.10.1) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas->datasets==2.10.1) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in /opt/conda/lib/python3.10/site-packages (from pandas->datasets==2.10.1) (2023.3)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas->datasets==2.10.1) (1.16.0)
Requirement already satisfied: wandb in /opt/conda/lib/python3.10/site-packages (0.15.11)
Requirement already satisfied: Click!=8.0.0,>=7.1 in /opt/conda/lib/python3.10/site-packages (from wandb) (8.1.7)
Requirement already satisfied: GitPython!=3.1.29,>=1.0.0 in /opt/conda/lib/python3.10/site-packages (from wandb) (3.1.32)
Requirement already satisfied: requests<3,>=2.0.0 in /opt/conda/lib/python3.10/site-packages (from wandb) (2.31.0)
Requirement already satisfied: psutil>=5.0.0 in /opt/conda/lib/python3.10/site-packages (from wandb) (5.9.3)
Requirement already satisfied: sentry-sdk>=1.0.0 in /opt/conda/lib/python3.10/site-packages (from wandb) (1.31.0)
Requirement already satisfied: docker-pycreds>=0.4.0 in /opt/conda/lib/python3.10/site-packages (from wandb) (0.4.0)
Requirement already satisfied: PyYAML in /opt/conda/lib/python3.10/site-packages (from wandb) (6.0.1)
Requirement already satisfied: pathtools in /opt/conda/lib/python3.10/site-packages (from wandb) (0.1.2)
Requirement already satisfied: setproctitle in /opt/conda/lib/python3.10/site-packages (from wandb) (1.3.2)
Requirement already satisfied: setuptools in /opt/conda/lib/python3.10/site-packages (from wandb) (68.1.2)
Requirement already satisfied: appdirs>=1.4.3 in /opt/conda/lib/python3.10/site-packages (from wandb) (1.4.4)
Requirement already satisfied: protobuf!=4.21.0,<5,>=3.19.0 in /opt/conda/lib/python3.10/site-packages (from wandb) (3.20.3)
Requirement already satisfied: six>=1.4.0 in /opt/conda/lib/python3.10/site-packages (from docker-pycreds>=0.4.0->wandb) (1.16.0)
Requirement already satisfied: gitdb<5,>=4.0.1 in /opt/conda/lib/python3.10/site-packages (from GitPython!=3.1.29,>=1.0.0->wandb) (4.0.10)
Requirement already satisfied: charset-normalizer<4,>=2 in /opt/conda/lib/python3.10/site-packages (from requests<3,>=2.0.0->wandb) (3.2.0)
Requirement already satisfied: idna<4,>=2.5 in /opt/conda/lib/python3.10/site-packages (from requests<3,>=2.0.0->wandb) (3.4)
Requirement already satisfied: urllib3<3,>=1.21.1 in /opt/conda/lib/python3.10/site-packages (from requests<3,>=2.0.0->wandb) (1.26.16)
Requirement already satisfied: certifi>=2017.4.17 in /opt/conda/lib/python3.10/site-packages (from requests<3,>=2.0.0->wandb) (2023.7.22)
Requirement already satisfied: smmap<6,>=3.0.1 in /opt/conda/lib/python3.10/site-packages (from gitdb<5,>=4.0.1->GitPython!=3.1.29,>=1.0.0->wandb) (5.0.0)
Requirement already satisfied: scipy in /opt/conda/lib/python3.10/site-packages (1.11.2)
Requirement already satisfied: numpy<1.28.0,>=1.21.6 in /opt/conda/lib/python3.10/site-packages (from scipy) (1.23.5)

I used an A100 GPU machine with Python 3.10 and cuda 11.8 to run this notebook. It took about an hour to run.

### Loading libraries

In [1]:
from datetime import datetime
import os
import sys

import torch
from peft import (
    LoraConfig,
    get_peft_model,
    get_peft_model_state_dict,
    prepare_model_for_int8_training,
    set_peft_model_state_dict,
)
from transformers import AutoTokenizer, AutoModelForCausalLM, TrainingArguments, Trainer, DataCollatorForSeq2Seq

(If you have import errors, try restarting your Jupyter kernel)

### Load dataset

In [2]:
from datasets import load_dataset
train_dataset = load_dataset('json', data_files='/home/sam/finetune-llm-for-rag/datasets/sql/MiniLM-L6/samlhuillier-sql-create-context-spider-intersect-train-with-2-examples.jsonl', split='train')
eval_dataset = load_dataset('json', data_files='/home/sam/finetune-llm-for-rag/datasets/sql/MiniLM-L6/samlhuillier-sql-create-context-spider-intersect-validation-with-2-examples.jsonl', split='train')
print(train_dataset)
print(eval_dataset)

Found cached dataset json (/home/sam/.cache/huggingface/datasets/json/default-8e74ab5de84b7560/0.0.0/0f7e3662623656454fcd2b650f34e886a7db4b9104504885bd462096cc7a9f51)
Found cached dataset json (/home/sam/.cache/huggingface/datasets/json/default-d78df93a57db14be/0.0.0/0f7e3662623656454fcd2b650f34e886a7db4b9104504885bd462096cc7a9f51)

Dataset({
    features: ['db_id', 'context', 'question', 'answer', 'full_prompt', 'inference_prompt'],
    num_rows: 3961
})
Dataset({
    features: ['db_id', 'context', 'question', 'answer', 'full_prompt', 'inference_prompt'],
    num_rows: 568
})

In [18]:
for x in eval_dataset:
    print(x)

{'db_id': 'concert_singer', 'context': 'CREATE TABLE singer (Id VARCHAR)', 'question': 'How many singers do we have?', 'answer': 'SELECT count(*) FROM singer', 'full_prompt': 'You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables. You must output the SQL query that answers the question.\n\nGiven the following examples:\nExample 1:\n### Input:\nHow many actors are there?\n\n### Context:\nCREATE TABLE actor (Id VARCHAR)\n\n### Response:\nSELECT count(*) FROM actor\n\nExample 2:\n### Input:\nHow many employees do we have?\n\n### Context:\nCREATE TABLE Employee (Id VARCHAR)\n\n### Response:\nSELECT count(*) FROM Employee\n\nPlease generate the SQL query that answers the following:\n### Input:\nHow many singers do we have?\n\n### Context:\nCREATE TABLE singer (Id VARCHAR)\n\n### Response:\nSELECT count(*) FROM singer', 'inference_prompt': 'You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables. You must output the SQL query that answers the question.\n\nGiven the following examples:\nExample 1:\n### Input:\nHow many actors are there?\n\n### Context:\nCREATE TABLE actor (Id VARCHAR)\n\n### Response:\nSELECT count(*) FROM actor\n\nExample 2:\n### Input:\nHow many employees do we have?\n\n### Context:\nCREATE TABLE Employee (Id VARCHAR)\n\n### Response:\nSELECT count(*) FROM Employee\n\nPlease generate the SQL query that answers the following:\n### Input:\nHow many singers do we have?\n\n### Context:\nCREATE TABLE singer (Id VARCHAR)\n\n### Response:'}
{'db_id': 'concert_singer', 'context': 'CREATE TABLE singer (name VARCHAR, country VARCHAR, age VARCHAR)', 'question': 'Show name, country, age for all singers ordered by age from the oldest to the youngest.', 'answer': 'SELECT name ,  country ,  age FROM singer ORDER BY age DESC', 'full_prompt': 'You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables. You must output the SQL query that answers the question.\n\nGiven the following examples:\nExample 1:\n### Input:\nShow names of actors in descending order of the year their musical is awarded.\n\n### Context:\nCREATE TABLE musical (Musical_ID VARCHAR, Year VARCHAR); CREATE TABLE actor (Name VARCHAR, Musical_ID VARCHAR)\n\n### Response:\nSELECT T1.Name FROM actor AS T1 JOIN musical AS T2 ON T1.Musical_ID  =  T2.Musical_ID ORDER BY T2.Year DESC\n\nExample 2:\n### Input:\nList the name of actors whose age is not 20.\n\n### Context:\nCREATE TABLE actor (Name VARCHAR, Age VARCHAR)\n\n### Response:\nSELECT Name FROM actor WHERE Age != 20\n\nPlease generate the SQL query that answers the following:\n### Input:\nShow name, country, age for all singers ordered by age from the oldest to the youngest.\n\n### Context:\nCREATE TABLE singer (name VARCHAR, country VARCHAR, age VARCHAR)\n\n### Response:\nSELECT name ,  country ,  age FROM singer ORDER BY age DESC', 'inference_prompt': 'You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables. You must output the SQL query that answers the question.\n\nGiven the following examples:\nExample 1:\n### Input:\nShow names of actors in descending order of the year their musical is awarded.\n\n### Context:\nCREATE TABLE musical (Musical_ID VARCHAR, Year VARCHAR); CREATE TABLE actor (Name VARCHAR, Musical_ID VARCHAR)\n\n### Response:\nSELECT T1.Name FROM actor AS T1 JOIN musical AS T2 ON T1.Musical_ID  =  T2.Musical_ID ORDER BY T2.Year DESC\n\nExample 2:\n### Input:\nList the name of actors whose age is not 20.\n\n### Context:\nCREATE TABLE actor (Name VARCHAR, Age VARCHAR)\n\n### Response:\nSELECT Name FROM actor WHERE Age != 20\n\nPlease generate the SQL query that answers the following:\n### Input:\nShow name, country, age for all singers ordered by age from the oldest to the youngest.\n\n### Context:\nCREATE TABLE singer (name VARCHAR, country VARCHAR, age VARCHAR)\n\n### Response:'}
{'db_id': 'concert_singer', 'context': 'CREATE TABLE singer (age INTEGER, country VARCHAR)', 'question': 'What is the average, minimum, and maximum age of all singers from France?', 'answer': "SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'", 'full_prompt': "You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables. You must output the SQL query that answers the question.\n\nGiven the following examples:\nExample 1:\n### Input:\nWhat are the distinct ages of the heads who are acting?\n\n### Context:\nCREATE TABLE head (age VARCHAR, head_id VARCHAR); CREATE TABLE management (head_id VARCHAR, temporary_acting VARCHAR)\n\n### Response:\nSELECT DISTINCT T1.age FROM management AS T2 JOIN head AS T1 ON T1.head_id  =  T2.head_id WHERE T2.temporary_acting  =  'Yes'\n\nExample 2:\n### Input:\nWhat is the duration of the oldest actor?\n\n### Context:\nCREATE TABLE actor (Duration VARCHAR, Age VARCHAR)\n\n### Response:\nSELECT Duration FROM actor ORDER BY Age DESC LIMIT 1\n\nPlease generate the SQL query that answers the following:\n### Input:\nWhat is the average, minimum, and maximum age of all singers from France?\n\n### Context:\nCREATE TABLE singer (age INTEGER, country VARCHAR)\n\n### Response:\nSELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'", 'inference_prompt': "You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables. You must output the SQL query that answers the question.\n\nGiven the following examples:\nExample 1:\n### Input:\nWhat are the distinct ages of the heads who are acting?\n\n### Context:\nCREATE TABLE head (age VARCHAR, head_id VARCHAR); CREATE TABLE management (head_id VARCHAR, temporary_acting VARCHAR)\n\n### Response:\nSELECT DISTINCT T1.age FROM management AS T2 JOIN head AS T1 ON T1.head_id  =  T2.head_id WHERE T2.temporary_acting  =  'Yes'\n\nExample 2:\n### Input:\nWhat is the duration of the oldest actor?\n\n### Context:\nCREATE TABLE actor (Duration VARCHAR, Age VARCHAR)\n\n### Response:\nSELECT Duration FROM actor ORDER BY Age DESC LIMIT 1\n\nPlease generate the SQL query that answers the following:\n### Input:\nWhat is the average, minimum, and maximum age of all singers from France?\n\n### Context:\nCREATE TABLE singer (age INTEGER, country VARCHAR)\n\n### Response:"}
{'db_id': 'concert_singer', 'context': 'CREATE TABLE singer (song_name VARCHAR, song_release_year VARCHAR, age VARCHAR)', 'question': 'Show the name and the release year of the song by the youngest singer.', 'answer': 'SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1', 'full_prompt': 'You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables. You must output the SQL query that answers the question.\n\nGiven the following examples:\nExample 1:\n### Input:\nWhat is the last name of the youngest student?\n\n### Context:\nCREATE TABLE Student (LName VARCHAR, age INTEGER)\n\n### Response:\nSELECT LName FROM Student WHERE age  =  (SELECT min(age) FROM Student)\n\nExample 2:\n### Input:\nShow names of actors in descending order of the year their musical is awarded.\n\n### Context:\nCREATE TABLE musical (Musical_ID VARCHAR, Year VARCHAR); CREATE TABLE actor (Name VARCHAR, Musical_ID VARCHAR)\n\n### Response:\nSELECT T1.Name FROM actor AS T1 JOIN musical AS T2 ON T1.Musical_ID  =  T2.Musical_ID ORDER BY T2.Year DESC\n\nPlease generate the SQL query that answers the following:\n### Input:\nShow the name and the release year of the song by the youngest singer.\n\n### Context:\nCREATE TABLE singer (song_name VARCHAR, song_release_year VARCHAR, age VARCHAR)\n\n### Response:\nSELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1', 'inference_prompt': 'You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables. You must output the SQL query that answers the question.\n\nGiven the following examples:\nExample 1:\n### Input:\nWhat is the last name of the youngest student?\n\n### Context:\nCREATE TABLE Student (LName VARCHAR, age INTEGER)\n\n### Response:\nSELECT LName FROM Student WHERE age  =  (SELECT min(age) FROM Student)\n\nExample 2:\n### Input:\nShow names of actors in descending order of the year their musical is awarded.\n\n### Context:\nCREATE TABLE musical (Musical_ID VARCHAR, Year VARCHAR); CREATE TABLE actor (Name VARCHAR, Musical_ID VARCHAR)\n\n### Response:\nSELECT T1.Name FROM actor AS T1 JOIN musical AS T2 ON T1.Musical_ID  =  T2.Musical_ID ORDER BY T2.Year DESC\n\nPlease generate the SQL query that answers the following:\n### Input:\nShow the name and the release year of the song by the youngest singer.\n\n### Context:\nCREATE TABLE singer (song_name VARCHAR, song_release_year VARCHAR, age VARCHAR)\n\n### Response:'}
{'db_id': 'concert_singer', 'context': 'CREATE TABLE singer (country VARCHAR, age INTEGER)', 'question': 'What are all distinct countries where singers above age 20 are from?', 'answer': 'SELECT DISTINCT country FROM singer WHERE age  >  20', 'full_prompt': 'You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables. You must output the SQL query that answers the question.\n\nGiven the following examples:\nExample 1:\n### Input:\nList the name of actors whose age is not 20.\n\n### Context:\nCREATE TABLE actor (Name VARCHAR, Age VARCHAR)\n\n### Response:\nSELECT Name FROM actor WHERE Age != 20\n\nExample 2:\n### Input:\nWhat are the names of the states where at least 3 heads were born?\n\n### Context:\nCREATE TABLE head (born_state VARCHAR)\n\n### Response:\nSELECT born_state FROM head GROUP BY born_state HAVING count(*)  >=  3\n\nPlease generate the SQL query that answers the following:\n### Input:\nWhat are all distinct countries where singers above age 20 are from?\n\n### Context:\nCREATE TABLE singer (country VARCHAR, age INTEGER)\n\n### Response:\nSELECT DISTINCT country FROM singer WHERE age  >  20', 'inference_prompt': 'You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables. You must output the SQL query that answers the question.\n\nGiven the following examples:\nExample 1:\n### Input:\nList the name of actors whose age is not 20.\n\n### Context:\nCREATE TABLE actor (Name VARCHAR, Age VARCHAR)\n\n### Response:\nSELECT Name FROM actor WHERE Age != 20\n\nExample 2:\n### Input:\nWhat are the names of the states where at least 3 heads were born?\n\n### Context:\nCREATE TABLE head (born_state VARCHAR)\n\n### Response:\nSELECT born_state FROM head GROUP BY born_state HAVING count(*)  >=  3\n\nPlease generate the SQL query that answers the following:\n### Input:\nWhat are all distinct countries where singers above age 20 are from?\n\n### Context:\nCREATE TABLE singer (country VARCHAR, age INTEGER)\n\n### Response:'}
{'db_id': 'concert_singer', 'context': 'CREATE TABLE singer (country VARCHAR)', 'question': 'Show all countries and the number of singers in each country.', 'answer': 'SELECT country ,  count(*) FROM singer GROUP BY country', 'full_prompt': 'You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables. You must output the SQL query that answers the question.\n\nGiven the following examples:\nExample 1:\n### Input:\nShow all destinations and the number of flights to each destination.\n\n### Context:\nCREATE TABLE Flight (destination VARCHAR)\n\n### Response:\nSELECT destination ,  count(*) FROM Flight GROUP BY destination\n\nExample 2:\n### Input:\nShow all cities and corresponding number of students.\n\n### Context:\nCREATE TABLE Student (city_code VARCHAR)\n\n### Response:\nSELECT city_code ,  count(*) FROM Student GROUP BY city_code\n\nPlease generate the SQL query that answers the following:\n### Input:\nShow all countries and the number of singers in each country.\n\n### Context:\nCREATE TABLE singer (country VARCHAR)\n\n### Response:\nSELECT country ,  count(*) FROM singer GROUP BY country', 'inference_prompt': 'You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables. You must output the SQL query that answers the question.\n\nGiven the following examples:\nExample 1:\n### Input:\nShow all destinations and the number of flights to each destination.\n\n### Context:\nCREATE TABLE Flight (destination VARCHAR)\n\n### Response:\nSELECT destination ,  count(*) FROM Flight GROUP BY destination\n\nExample 2:\n### Input:\nShow all cities and corresponding number of students.\n\n### Context:\nCREATE TABLE Student (city_code VARCHAR)\n\n### Response:\nSELECT city_code ,  count(*) FROM Student GROUP BY city_code\n\nPlease generate the SQL query that answers the following:\n### Input:\nShow all countries and the number of singers in each country.\n\n### Context:\nCREATE TABLE singer (country VARCHAR)\n\n### Response:'}
{'db_id': 'concert_singer', 'context': 'CREATE TABLE singer (song_name VARCHAR, age INTEGER)', 'question': 'List all song names by singers above the average age.', 'answer': 'SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)', 'full_prompt': 'You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables. You must output the SQL query that answers the question.\n\nGiven the following examples:\nExample 1:\n### Input:\nList the name of actors whose age is not 20.\n\n### Context:\nCREATE TABLE actor (Name VARCHAR, Age VARCHAR)\n\n### Response:\nSELECT Name FROM actor WHERE Age != 20\n\nExample 2:\n### Input:\nShow names of actors in descending order of the year their musical is awarded.\n\n### Context:\nCREATE TABLE musical (Musical_ID VARCHAR, Year VARCHAR); CREATE TABLE actor (Name VARCHAR, Musical_ID VARCHAR)\n\n### Response:\nSELECT T1.Name FROM actor AS T1 JOIN musical AS T2 ON T1.Musical_ID  =  T2.Musical_ID ORDER BY T2.Year DESC\n\nPlease generate the SQL query that answers the following:\n### Input:\nList all song names by singers above the average age.\n\n### Context:\nCREATE TABLE singer (song_name VARCHAR, age INTEGER)\n\n### Response:\nSELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)', 'inference_prompt': 'You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables. You must output the SQL query that answers the question.\n\nGiven the following examples:\nExample 1:\n### Input:\nList the name of actors whose age is not 20.\n\n### Context:\nCREATE TABLE actor (Name VARCHAR, Age VARCHAR)\n\n### Response:\nSELECT Name FROM actor WHERE Age != 20\n\nExample 2:\n### Input:\nShow names of actors in descending order of the year their musical is awarded.\n\n### Context:\nCREATE TABLE musical (Musical_ID VARCHAR, Year VARCHAR); CREATE TABLE actor (Name VARCHAR, Musical_ID VARCHAR)\n\n### Response:\nSELECT T1.Name FROM actor AS T1 JOIN musical AS T2 ON T1.Musical_ID  =  T2.Musical_ID ORDER BY T2.Year DESC\n\nPlease generate the SQL query that answers the following:\n### Input:\nList all song names by singers above the average age.\n\n### Context:\nCREATE TABLE singer (song_name VARCHAR, age INTEGER)\n\n### Response:'}
{'db_id': 'concert_singer', 'context': 'CREATE TABLE stadium (LOCATION VARCHAR, name VARCHAR, capacity INTEGER)', 'question': 'Show location and name for all stadiums with a capacity between 5000 and 10000.', 'answer': 'SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000', 'full_prompt': 'You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables. You must output the SQL query that answers the question.\n\nGiven the following examples:\nExample 1:\n### Input:\nPlease show the themes of competitions with host cities having populations larger than 1000.\n\n### Context:\nCREATE TABLE city (City_ID VARCHAR, Population INTEGER); CREATE TABLE farm_competition (Theme VARCHAR, Host_city_ID VARCHAR)\n\n### Response:\nSELECT T2.Theme FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID WHERE T1.Population  >  1000\n\nExample 2:\n### Input:\nShow the official names of the cities that have hosted more than one competition.\n\n### Context:\nCREATE TABLE farm_competition (Host_city_ID VARCHAR); CREATE TABLE city (Official_Name VARCHAR, City_ID VARCHAR)\n\n### Response:\nSELECT T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID HAVING COUNT(*)  >  1\n\nPlease generate the SQL query that answers the following:\n### Input:\nShow location and name for all stadiums with a capacity between 5000 and 10000.\n\n### Context:\nCREATE TABLE stadium (LOCATION VARCHAR, name VARCHAR, capacity INTEGER)\n\n### Response:\nSELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000', 'inference_prompt': 'You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables. You must output the SQL query that answers the question.\n\nGiven the following examples:\nExample 1:\n### Input:\nPlease show the themes of competitions with host cities having populations larger than 1000.\n\n### Context:\nCREATE TABLE city (City_ID VARCHAR, Population INTEGER); CREATE TABLE farm_competition (Theme VARCHAR, Host_city_ID VARCHAR)\n\n### Response:\nSELECT T2.Theme FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID WHERE T1.Population  >  1000\n\nExample 2:\n### Input:\nShow the official names of the cities that have hosted more than one competition.\n\n### Context:\nCREATE TABLE farm_competition (Host_city_ID VARCHAR); CREATE TABLE city (Official_Name VARCHAR, City_ID VARCHAR)\n\n### Response:\nSELECT T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID HAVING COUNT(*)  >  1\n\nPlease generate the SQL query that answers the following:\n### Input:\nShow location and name for all stadiums with a capacity between 5000 and 10000.\n\n### Context:\nCREATE TABLE stadium (LOCATION VARCHAR, name VARCHAR, capacity INTEGER)\n\n### Response:'}

The above pulls the dataset from the Huggingface Hub and splits 10% of it into an evaluation set to check how well the model is doing through training. If you want to load your own dataset do this:

```
train_dataset = load_dataset('json', data_files='train_set.jsonl', split='train')
eval_dataset = load_dataset('json', data_files='validation_set.jsonl', split='train')
```

And if you want to view any samples in the dataset just do something like:``` ```

In [3]:
print(train_dataset[3])

{'db_id': 'department_management', 'context': 'CREATE TABLE department (budget_in_billions INTEGER)', 'question': 'What are the maximum and minimum budget of the departments?', 'answer': 'SELECT max(budget_in_billions) ,  min(budget_in_billions) FROM department', 'full_prompt': 'You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables. You must output the SQL query that answers the question.\n\nGiven the following examples:\nExample 1:\n### Input:\nList the creation year, name and budget of each department.\n\n### Context:\nCREATE TABLE department (creation VARCHAR, name VARCHAR, budget_in_billions VARCHAR)\n\n### Response:\nSELECT creation ,  name ,  budget_in_billions FROM department\n\nExample 2:\n### Input:\nIn which year were most departments established?\n\n### Context:\nCREATE TABLE department (creation VARCHAR)\n\n### Response:\nSELECT creation FROM department GROUP BY creation ORDER BY count(*) DESC LIMIT 1\n\nPlease generate the SQL query that answers the following:\n### Input:\nWhat are the maximum and minimum budget of the departments?\n\n### Context:\nCREATE TABLE department (budget_in_billions INTEGER)\n\n### Response:\nSELECT max(budget_in_billions) ,  min(budget_in_billions) FROM department', 'inference_prompt': 'You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables. You must output the SQL query that answers the question.\n\nGiven the following examples:\nExample 1:\n### Input:\nList the creation year, name and budget of each department.\n\n### Context:\nCREATE TABLE department (creation VARCHAR, name VARCHAR, budget_in_billions VARCHAR)\n\n### Response:\nSELECT creation ,  name ,  budget_in_billions FROM department\n\nExample 2:\n### Input:\nIn which year were most departments established?\n\n### Context:\nCREATE TABLE department (creation VARCHAR)\n\n### Response:\nSELECT creation FROM department GROUP BY creation ORDER BY count(*) DESC LIMIT 1\n\nPlease generate the SQL query that answers the following:\n### Input:\nWhat are the maximum and minimum budget of the departments?\n\n### Context:\nCREATE TABLE department (budget_in_billions INTEGER)\n\n### Response:'}

Each entry is made up of a text 'question', the sql table 'context' and the 'answer'.

### Load model
I load code llama from huggingface in int8. Standard for Lora:

In [4]:
base_model = "codellama/CodeLlama-7b-hf"
model = AutoModelForCausalLM.from_pretrained(
    base_model,
    load_in_8bit=True,
    torch_dtype=torch.float16,
    device_map="auto",
)
tokenizer = AutoTokenizer.from_pretrained("codellama/CodeLlama-7b-hf")

The model weights are not tied. Please use the `tie_weights` method before using the `infer_auto_device` function.

Loading checkpoint shards:   0%|          | 0/2 [00:00<?, ?it/s]

Loading the tokenizer from the `special_tokens_map.json` and the `added_tokens.json` will be removed in `transformers 5`,  it is kept for forward compatibility, but it is recommended to update your `tokenizer_config.json` by uploading it again. You will see the new `added_tokens_decoder` attribute that will store the relevant information.

torch_dtype=torch.float16 means computations are performed using a float16 representation, even though the values themselves are 8 bit ints.

If you get error "ValueError: Tokenizer class CodeLlamaTokenizer does not exist or is not currently imported." Make sure you have transformers version is 4.33.0.dev0 and accelerate is >=0.20.3.

### 3. Check base model
A very good common practice is to check whether a model can already do the task at hand. Fine-tuning is something you want to try to avoid at all cost:

In [5]:
eval_prompt = """You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables.

You must output the SQL query that answers the question.
### Input:
Which Class has a Frequency MHz larger than 91.5, and a City of license of hyannis, nebraska?

### Context:
CREATE TABLE table_name_12 (class VARCHAR, frequency_mhz VARCHAR, city_of_license VARCHAR)

### Response:
"""
# {'question': 'Name the comptroller for office of prohibition', 'context': 'CREATE TABLE table_22607062_1 (comptroller VARCHAR, ticket___office VARCHAR)', 'answer': 'SELECT comptroller FROM table_22607062_1 WHERE ticket___office = "Prohibition"'}
model_input = tokenizer(eval_prompt, return_tensors="pt").to("cuda")

model.eval()
with torch.no_grad():
    print(tokenizer.decode(model.generate(**model_input, max_new_tokens=100)[0], skip_special_tokens=True))

Setting `pad_token_id` to `eos_token_id`:2 for open-end generation.

You are a powerful text-to-SQL model. Your job is to answer questions about a database. You are given a question and context regarding one or more tables.

You must output the SQL query that answers the question.
### Input:
Which Class has a Frequency MHz larger than 91.5, and a City of license of hyannis, nebraska?

### Context:
CREATE TABLE table_name_12 (class VARCHAR, frequency_mhz VARCHAR, city_of_license VARCHAR)

### Response:
SELECT * FROM table_name_12 WHERE class > '91.5' AND city_of_license = 'hyannis'

### Input:
Which Class has a Frequency MHz larger than 91.5, and a City of license of hyannis, nebraska?

### Context:
CREATE TABLE table_name_12 (class VARCHAR, frequency_mhz VARCHAR, city_of_lic

I get the output:
```
SELECT * FROM table_name_12 WHERE class > 91.5 AND city_of_license = 'hyannis, nebraska'
```
which is clearly wrong if the input is asking for just class!

### 4. Tokenization
Setup some tokenization settings like left padding because it makes [training use less memory](https://ai.stackexchange.com/questions/41485/while-fine-tuning-a-decoder-only-llm-like-llama-on-chat-dataset-what-kind-of-pa):

In [6]:
tokenizer.add_eos_token = True
tokenizer.pad_token_id = 0
tokenizer.padding_side = "left"

Setup the tokenize function to make labels and input_ids the same. This is basically what [self-supervised fine-tuning](https://neptune.ai/blog/self-supervised-learning) is:

In [7]:
def tokenize(prompt):
    result = tokenizer(
        prompt,
        truncation=True,
        max_length=700,
        padding=False,
        return_tensors=None,
    )

    # "self-supervised learning" means the labels are also the inputs:
    result["labels"] = result["input_ids"].copy()

    return result

And run convert each data_point into a prompt that I found online that works quite well:

In [8]:
def generate_and_tokenize_prompt(data_point):
    full_prompt = data_point["full_prompt"]
    return tokenize(full_prompt)

Reformat to prompt and tokenize each sample:

In [9]:
tokenized_train_dataset = train_dataset.map(generate_and_tokenize_prompt)
tokenized_val_dataset = eval_dataset.map(generate_and_tokenize_prompt)

Loading cached processed dataset at /home/sam/.cache/huggingface/datasets/json/default-8e74ab5de84b7560/0.0.0/0f7e3662623656454fcd2b650f34e886a7db4b9104504885bd462096cc7a9f51/cache-2499a002c5c14ab5.arrow
Loading cached processed dataset at /home/sam/.cache/huggingface/datasets/json/default-d78df93a57db14be/0.0.0/0f7e3662623656454fcd2b650f34e886a7db4b9104504885bd462096cc7a9f51/cache-ad98e389bdcd361d.arrow

### 5. Setup Lora

In [10]:
model.train() # put model back into training mode
model = prepare_model_for_int8_training(model)

config = LoraConfig(
    r=16,
    lora_alpha=16,
    target_modules=[
    "q_proj",
    "k_proj",
    "v_proj",
    "o_proj",
],
    lora_dropout=0.05,
    bias="none",
    task_type="CAUSAL_LM",
)
model = get_peft_model(model, config)

Optional stuff to setup Weights and Biases to view training graphs:

In [11]:
wandb_project = "testing-dataloaders"
if len(wandb_project) > 0:
    os.environ["WANDB_PROJECT"] = wandb_project

In [12]:
if torch.cuda.device_count() > 1:
    # keeps Trainer from trying its own DataParallelism when more than 1 gpu is available
    model.is_parallelizable = True
    model.model_parallel = True

In [13]:
import numpy as np
from transformers import EvalPrediction

def compute_perplexity(eval_pred: EvalPrediction):
    """
    Compute perplexity for HuggingFace Transformers evaluation.
    
    Parameters:
        eval_pred (EvalPrediction): A namedtuple containing two elements:
            - predictions (np.array): Predicted logits from the model.
            - label_ids (np.array): Ground truth labels.
            
    Returns:
        dict: A dictionary containing the perplexity score.
    """
    print("COMPUTING PERPLEXITY")
    logits, labels = eval_pred.predictions, eval_pred.label_ids
    # Exclude padding tokens (often with id=-100)
    mask = labels != -100
    logits = logits[mask]
    labels = labels[mask]

    # Compute the cross entropy
    cross_entropy = -np.log(logits[np.arange(len(logits)), labels])
    mean_cross_entropy = cross_entropy.mean()

    # Calculate the perplexity
    perplexity = np.exp(mean_cross_entropy)

    return {"perplexity": perplexity}

def dummy_metric(eval_pred):
    """
    A dummy metric function for debugging purposes.
    
    Parameters:
        eval_pred (tuple): A tuple containing predictions and labels. 
                           We won't use them in this function.
            
    Returns:
        dict: A dictionary containing a dummy metric value.
    """
    return {"dummy_metric": 42.0}

### 6. Training arguments
If you run out of GPU memory, change per_device_train_batch_size. The gradient_accumulation_steps variable should ensure this doesn't affect batch dynamics during the training run. All the other variables are standard stuff that I wouldn't recommend messing with:

In [14]:
batch_size = 128
per_device_train_batch_size = 1
gradient_accumulation_steps = batch_size // per_device_train_batch_size
output_dir = "testing-dataloader"

training_args = TrainingArguments(
        per_device_train_batch_size=per_device_train_batch_size,
        gradient_accumulation_steps=gradient_accumulation_steps,
        warmup_steps=100,
        max_steps=400,
        learning_rate=3e-4,
        fp16=True,
        logging_steps=1,
        optim="adamw_torch",
        evaluation_strategy="steps", # if val_set_size > 0 else "no",
        save_strategy="steps",
        eval_steps=1,
        save_steps=50,
        output_dir=output_dir,
        # save_total_limit=3,
        load_best_model_at_end=False,
        # ddp_find_unused_parameters=False if ddp else None,
        group_by_length=True, # group sequences of roughly the same length together to speed up training
        report_to="none", # if use_wandb else "none",
        run_name=f"codellama-{datetime.now().strftime('%Y-%m-%d-%H-%M')}", # if use_wandb else None,
    )

trainer = Trainer(
    model=model,
    train_dataset=tokenized_train_dataset,
    eval_dataset=tokenized_val_dataset,
    args=training_args,
    data_collator=DataCollatorForSeq2Seq(
        tokenizer, pad_to_multiple_of=8, return_tensors="pt", padding=True
    ),
    compute_metrics=compute_perplexity
)

In [15]:
print(model.forward.__doc__)

None

Then we do some pytorch-related optimisation (which just make training faster but don't affect accuracy):

In [16]:
model.config.use_cache = False

old_state_dict = model.state_dict
model.state_dict = (lambda self, *_, **__: get_peft_model_state_dict(self, old_state_dict())).__get__(
    model, type(model)
)
if torch.__version__ >= "2" and sys.platform != "win32":
    print("compiling the model")
    model = torch.compile(model)

compiling the model

In [17]:
trainer.train()

You're using a CodeLlamaTokenizerFast tokenizer. Please note that with a fast tokenizer, using the `__call__` method is faster than using a method to encode the text followed by a call to the `pad` method to get a padded encoding.

 Traceback (most recent call last)
 in <module>:1

  1 trainer.train()
   2

 /opt/conda/lib/python3.10/site-packages/transformers/trainer.py:1589 in train

   1586          finally:
   1587             hf_hub_utils.enable_progress_bars()
   1588       else:
  1589          return inner_training_loop(
   1590             args=args,
   1591             resume_from_checkpoint=resume_from_checkpoint,
   1592             trial=trial,

 /opt/conda/lib/python3.10/site-packages/transformers/trainer.py:1982 in _inner_training_loop

   1979                self.state.epoch = epoch + (step + 1 + steps_skipped) / steps_in_epo
   1980                self.control = self.callback_handler.on_step_end(args, self.state, s
   1981
  1982                self._maybe_log_save_evaluate(tr_loss, model, trial, epoch, ignore_k
   1983             else:
   1984                self.control = self.callback_handler.on_substep_end(args, self.state
   1985

 /opt/conda/lib/python3.10/site-packages/transformers/trainer.py:2326 in _maybe_log_save_evaluate

   2323                )
   2324                metrics.update(dataset_metrics)
   2325          else:
  2326             metrics = self.evaluate(ignore_keys=ignore_keys_for_eval)
   2327          self._report_to_hp_search(trial, self.state.global_step, metrics)
   2328
   2329          # Run delayed LR scheduler now that metrics are populated

 /opt/conda/lib/python3.10/site-packages/transformers/trainer.py:3064 in evaluate

   3061       start_time = time.time()
   3062
   3063       eval_loop = self.prediction_loop if self.args.use_legacy_prediction_loop else se
  3064       output = eval_loop(
   3065          eval_dataloader,
   3066          description="Evaluation",
   3067          # No point gathering the predictions if there are no metrics, otherwise we d

 /opt/conda/lib/python3.10/site-packages/transformers/trainer.py:3279 in evaluation_loop

   3276             if self.preprocess_logits_for_metrics is not None:
   3277                logits = self.preprocess_logits_for_metrics(logits, labels)
   3278             logits = self.accelerator.gather_for_metrics((logits))
  3279             preds_host = logits if preds_host is None else nested_concat(preds_host,
   3280
   3281          if labels is not None:
   3282             labels = self.accelerator.gather_for_metrics((labels))

 /opt/conda/lib/python3.10/site-packages/transformers/trainer_pt_utils.py:123 in nested_concat

    120    if isinstance(tensors, (list, tuple)):
    121       return type(tensors)(nested_concat(t, n, padding_index=padding_index) for t, n i
    122    elif isinstance(tensors, torch.Tensor):
   123       return torch_pad_and_concatenate(tensors, new_tensors, padding_index=padding_ind
    124    elif isinstance(tensors, Mapping):
    125       return type(tensors)(
    126          {k: nested_concat(t, new_tensors[k], padding_index=padding_index) for k, t i

 /opt/conda/lib/python3.10/site-packages/transformers/trainer_pt_utils.py:88 in
 torch_pad_and_concatenate

     85    new_shape = (tensor1.shape[0] + tensor2.shape[0], max(tensor1.shape[1], tensor2.shap
     86
     87    # Now let's fill the result tensor
    88    result = tensor1.new_full(new_shape, padding_index)
     89    result[: tensor1.shape[0], : tensor1.shape[1]] = tensor1
     90    result[tensor1.shape[0] :, : tensor2.shape[1]] = tensor2
     91    return result

OutOfMemoryError: CUDA out of memory. Tried to allocate 13.38 GiB (GPU 0; 39.39 GiB total capacity; 20.41 GiB
already allocated; 13.07 GiB free; 25.12 GiB reserved in total by PyTorch) If reserved memory is >> allocated
memory try setting max_split_size_mb to avoid fragmentation.  See documentation for Memory Management and
PYTORCH_CUDA_ALLOC_CONF

In [16]:
import sys
print(sys.executable)

/opt/conda/bin/python